tags/1_0_37/adit-war/doc/testMessages/join.v1/add_institution.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xtee="http://x-tee.riik.ee/xsd/xtee.xsd" xmlns:adit="http://producers.ametlikud-dokumendid.xtee.riik.ee/producer/ametlikud-dokumendid">
   <soapenv:Header>
     <xtee:nimi>ametlikud-dokumendid.join.v1</xtee:nimi>
      <xtee:id>00000000000000</xtee:id>
      <xtee:isikukood>EE38005130332</xtee:isikukood>
      <xtee:andmekogu>ametlikud-dokumendid</xtee:andmekogu>
      <xtee:asutus>12345678</xtee:asutus>
      <xtee:allasutus>EE70006317</xtee:allasutus>
      <adit:infosysteem>kovtp</adit:infosysteem>
   </soapenv:Header>
   <soapenv:Body>
      <adit:Join>
         <keha>
            <adit:userType>institution</adit:userType>
            <adit:userName>Riigi Infosüsteemide Arenduskeskus</adit:userName>
         </keha>
      </adit:Join>
   </soapenv:Body>
</soapenv:Envelope>